In [2]:
# Import Libraries and Dependencies
import pandas as pd
from pathlib import Path

### 1. Combine and Clean the Data
#### Import CSVs

In [3]:
# Read the CSV files into DataFrames.
athletic_sales_2020 = pd.read_csv('Resources/athletic_sales_2020.csv')
athletic_sales_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [10]:
# Display the 2020 sales DataFrame
df = athletic_sales_2020

In [6]:
# Display the 2021 sales DataFrame
df = athletic_sales_2021

#### Check the data types of each DataFrame

In [14]:
# Check the 2020 sales data types.
print(df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [12]:
# Check the 2021 sales data types.
print(df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [17]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_df = pd.concat([athletic_sales_2020, athletic_sales_2021])
combined_df.reset_index(drop=True, inplace=True)

In [19]:
# Check if any values are null.
print(df.isnull().values.any())

False

In [ ]:
# Check the data type of each column
print(df.dtypes)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9643 entries, 0 to 9642
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9643 non-null   object
 1   retailer_id       9643 non-null   int64
 2   invoice_date      9643 non-null   object
 3   region            9643 non-null   object
 4   state             9643 non-null   object
 5   city              9643 non-null   object
 6   product           9643 non-null   object
 7   price_per_unit    9643 non-null   int64
 8   units_sold        9643 non-null   int64
 9   total_sales       9643 non-null   int64
 10  operating_profit  9643 non-null   float64
 11  sales_method      9643 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 904.2+ KB

In [12]:
# Convert the "invoice_date" to a datetime datatype
df['invoice_date'] = pd.to_datetime(df['invoice_date'])

NameError: name 'pd' is not defined

In [8]:
# Confirm that the "invoice_date" data type has been changed.
print('invoice_date').dtype

invoice_date

AttributeError: 'NoneType' object has no attribute 'dtype'

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [1]:
# Show the number products sold for region, state, and city.
region_state_city_sales = sales_data.groupby(['region', 'state', 'city'])['products_sold'].sum().reset_index()
# Rename the sum to "Total_Products_Sold".
region_state_city_sales = region_state_city_sales.rename(columns={'products_sold': 'Total_Products_Sold'})
# Show the top 5 results.
athletic_sales_analysis.head(5)

NameError: name 'sales_data' is not defined

#### Using `pivot_table`

In [2]:
# Show the number products sold for region, state, and city.
products_sold = sales_data.groupby(['region', 'state', 'city'])['number_of_products_sold'].sum()

# Rename the "units_sold" column to "Total_Products_Sold"
sales_data = sales_data.rename(columns={'units_sold': 'Total_Products_Sold'})


# Show the top 5 results.
athletic_sales_analysis_df.head(5)

NameError: name 'sales_data' is not defined

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [14]:
# Show the total sales for the products sold for each region, state, and city.
total_sales_by_location = sales_data.groupby(['region', 'state', 'city'])['Total_Sales'].sum()

# Rename the "total_sales" column to "Total Sales"
total_sales_by_location = total_sales_by_location.rename(columns={'total_sales': 'Total Sales'})


# Show the top 5 results.
athletic_sales_analysis_df.head(5)

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

#### Using `pivot_table`

In [15]:
# Show the total sales for the products sold for each region, state, and city.
pivot_table_sales = pd.pivot_table(df_sales, values='total_price', index=['region', 'state', 'city'], aggfunc=np.sum)
print(pivot_table_sales)

# Optional: Rename the "total_sales" column to "Total Sales"
df.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
athletic_sales_analysis_df.head(5)

                                        Total_Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [16]:
# Show the total sales for the products sold for each retailer, region, state, and city.
total_sales = df_sales.groupby(['retailer', 'region', 'state', 'city'])['total_price'].sum().reset_index()
print(total_sales)
# Rename the "total_sales" column to "Total Sales"
total_sales = df_sales.groupby(['retailer', 'region', 'state', 'city'])['total_price'].sum().reset_index()
total_sales = total_sales.rename(columns={'total_price': 'Total Sales'})


# Show the top 5 results.
athletic_sales_analysis_df.head(5)

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

#### Using `pivot_table`

In [17]:
# Show the total sales for the products sold for each retailer, region, state, and city.
pivot_table_sales = pd.pivot_table(df_sales, values='total_price', index=['retailer', 'region', 'state', 'city'], aggfunc=np.sum)

# Optional: Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.
athletic_sales_analysis_df.head(5)

                                                    Total_Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [18]:
# Filter the sales data to get the women's athletic footwear sales data.
women_athletic_sales = df_sales[df_sales['product_category'].str.contains('women') & df_sales['product_category'].str.contains('athletic') & df_sales['product_category'].str.contains('footwear')]
print(women_athletic_sales)

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
9633,Foot Locker,1185732,2021-12-30,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,57,53,3021,1601.13,Online
9634,Foot Locker,1185732,2021-12-30,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,40,53,2120,954.00,Outlet
9635,Amazon,1185732,2021-12-30,Northeast,Maine,Portland,Women's Athletic Footwear,42,36,1512,680.40,Online
9636,Amazon,1185732,2021-12-30,Northeast,Maine,Portland,Women's Athletic Footwear,45,125,56250,16875.00,Outlet
9637,Foot Locker,1185732,2021-12-30,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,60,175,105000,42000.00,Outlet

#### Using `groupby`

In [19]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
women_athletic_sales = df_sales[df_sales['product_category'].str.contains('women') & df_sales['product_category'].str.contains('athletic') & df_sales['product_category'].str.contains('footwear')]

total_womens_sales = women_athletic_sales.groupby(['retailer', 'region', 'state', 'city'])['quantity'].sum().reset_index()
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
women_athletic_sales = df_sales[df_sales['product_category'].str.contains('women') & df_sales['product_category'].str.contains('athletic') & df_sales['product_category'].str.contains('footwear')]

total_womens_sales = women_athletic_sales.groupby(['retailer', 'region', 'state', 'city'])['quantity'].sum().reset_index()
total_womens_sales = total_womens_sales.rename(columns={'quantity': 'Womens_Footwear_Units_Sold'})

# Show the top 5 results.
athletic_sales_analysis_df.head(5)

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

#### Using `pivot_table`

In [20]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
pivot_table_womens_sales = pd.pivot_table(women_athletic_sales, 
                                          values='quantity', 
                                          index=['retailer', 'region', 'state', 'city'], 
                                          aggfunc=np.sum)
pivot_table_womens_sales = pivot_table_womens_sales.rename(columns={'quantity': 'Womens_Footwear_Units_Sold'})
print(pivot_table_womens_sales)

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
pivot_table_womens_sales = pd.pivot_table(women_athletic_sales, 
                                          values='quantity', 
                                          index=['retailer', 'region', 'state', 'city'], 
                                          aggfunc=np.sum)
pivot_table_womens_sales = pivot_table_womens_sales.rename(columns={'quantity': 'Womens_Footwear_Units_Sold'})

# Show the top 5 results.
athletic_sales_analysis_df.head(5)

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [21]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pivot_table_sales = pd.pivot_table(df_sales, 
                                   values='total_sales', 
                                   index='invoice_date')

# Optional: Rename the "total_sales" column to "Total Sales"


# Show the table.
athletic_sales_analysis_df.head

              Total Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250
2020-01-23         188025
2020-01-28         376728
2020-01-29         190065
2020-02-03         390008
2020-02-04         268253

In [4]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales = pivot_table_sales.resample('D').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
sorted_daily_sales = daily_sales.sort_values(by='total_sales', ascending=False)

NameError: name 'pivot_table_sales' is not defined

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [23]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_sales = pivot_table_sales.resample('W').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
sorted_weekly_sales = weekly_sales.sort_values(by='total_sales', ascending=False)

              Total Sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2021-07-18        2801449
2021-11-14        2531721
2021-08-22        2491259
2021-08-15        2463941
2021-11-21        2449537
2021-05-16        2422132
2021-06-13        2358602